[{"doi": "10.1101/2020.04.26.20080770", "title": "A first study on the impact of containment measure on COVID-19 spread in Morocco", "authors": "Hammoumi, A.; Qesmi, R.", "author_corresponding": "Redouane Qesmi", "author_corresponding_institution": "USMBA University", "date": "2020-05-01", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/01/2020.04.26.20080770.source.xml", "abstract": "Background: Since the appearance of the first case of COVID-19 in Morocco, the cumulative number of reported infectious cases continues to increase and, consequently, the government imposed the containment measure within the country. Our aim is to predict the impact of the compulsory containment on COVID-19 spread. Earlier knowledge of the epidemic characteristics of COVID-19 transmission related to Morocco will be of great interest to establish an optimal plan-of-action to control the epidemic.\n\nMethod: Using a Susceptible-Asymptomatic-Infectious model and the data of reported cumulative confirmed cases in Morocco from March 2nd to April 9, 2020, we determined the basic and control reproduction numbers and we estimated the model parameter values. Furthermore, simulations of different scenarios of containment are performed.\n\nResults: Epidemic characteristics are predicted according to different rates of containment. The basic reproduction number is estimated to be 2.9949, with CI(2.6729-3.1485). Furthermore, a threshold value of containment rate, below which the epidemic duration is postponed, is determined.\n\nConclusion: Our findings show that the basic reproduction number reflects a high speed of spread of the epidemic. Furthermore, the compulsory containment can be efficient if more than 73% of population are confined. However, even with 90% of containment, the end-time is estimated to happen on July 4th which can be harmful and lead to consequent social-economic damages. Thus, containment need to be accompanied by other measures such as mass testing to reduce the size of asymptomatic population. Indeed, our sensitivity analysis investigation shows that the COVID-19 dynamics depends strongly on the asymptomatic duration as well as the contact and containment rates. Our results can help the Moroccan government to anticipate the spread of COVID-19 and avoid human loses and consequent social-economic damages as well.", "published": "10.1016/j.chaos.2020.110231", "server": "medrxiv"}, {"doi": "10.1101/2020.04.28.20082990", "title": "A simple model to show the relative risk of viral aerosol infection and the benefit of  wearing masks in different settings with implications for Covid-19 .", "authors": "Barr, G. D.", "author_corresponding": "Gerald D Barr", "author_corresponding_institution": "Independent Health Research", "date": "2020-05-05", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "public and global health", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/05/2020.04.28.20082990.source.xml", "abstract": "Background: Widespread use of masks in the general population is being used in many countries for control of Covid-19. There has been reluctance on the part of the WHO and some governments to recommend this.\n\nMethodology: A basic model has been constructed to show the relative risk of aerosol from normal breathing in various situations together with the relative benefit from use of different masks.\n\nResults: The benefit from mask use between individuals is multiplicative not additive and although social distancing at 2 meters appears beneficial with regards to aerosol infectivity, in confined areas this is time limited requiring additional measures such as masks. The model shows the relative benefit of masks when social distancing is not possible at all times, or when in confined areas which can also be aided by efficient ventilation. Where a person is in one place for a prolonged period there is more risk requiring protection.\n\nConclusions: Masks should be used in the above situations especially at an early stage of an outbreak. Public health planning requires stockpiling of masks and encouraging everyone to have suitable masks in their household when supplies are normalised. In the absence of widely available good quality masks the use of a cloth mask will be better than no protection at all.", "published": "10.37871/ajeph.id32", "server": "medrxiv"}, {"doi": "10.1101/2020.04.02.20051482", "title": "A novel cohort analysis approach to determining the case fatality rate of COVID-19 and other infectious diseases", "authors": "Narayanan, C. S.", "author_corresponding": "Charit S Narayanan", "author_corresponding_institution": "Mission San Jose High School", "date": "2020-04-06", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/06/2020.04.02.20051482.source.xml", "abstract": "As the Coronavirus contagion develops, it is increasingly important to understand the dynamics of the disease. Its severity is best described by two parameters: its ability to spread and its lethality. Here, we combine a mathematical model with a cohort analysis approach to determine the range of case fatality rates (CFR). We use a logistical function to describe the exponential growth and subsequent flattening of COVID-19 CFR that depends on three parameters: the final CFR (L), the CFR growth rate (k), and the onset-to-death interval (t0). Using the logistic model with specific parameters (L, k and t0), we calculate the number of deaths each day for each cohort. We build an objective function that minimizes the root mean square error between the actual and predicted values of cumulative deaths and run multiple simulations by altering the three parameters. Using all of these values, we find out which set of parameters returns the lowest error when compared to the number of actual deaths. We were able to predict the CFR much closer to reality at all stages of the viral outbreak compared to traditional methods. This model can be used far more effectively than current models to estimate the CFR during an outbreak, allowing for better planning. The model can also help us better understand the impact of individual interventions on the CFR. With much better data collection and labeling, we should be able to improve our predictive power even further.", "published": "10.1371/journal.pone.0233146", "server": "medrxiv"}, {"doi": "10.1101/2020.05.21.20108621", "title": "A pandemic at the Tunisian scale. Mathematical modelling of reported and unreported COVID-19 infected cases", "authors": "Abdeljaoued-Tej, I.", "author_corresponding": "Ines Abdeljaoued-Tej", "author_corresponding_institution": "BIMS Laboratory, LR16IPT09, Institut Pasteur de Tunis, University of Tunis El Manar, Tunisia", "date": "2020-05-23", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/23/2020.05.21.20108621.source.xml", "abstract": "Starting from the city of Wuhan in China in late December 2019, the pandemic quickly spread to the rest of the world along the main intercontinental air routes. At the time of writing this article, there are officially about five million infections and more than 300 000 deaths. Statistics vary widely from country to country, revealing significant differences in anticipation and management of the crisis. We propose to examine the COVID-19 epidemic in Tunisia through mathematical models, which aim to determine the actual number of infected cases and to predict the course of the epidemic. As of May 11, 2020, there are officially 1032 COVID-19 infected cases in Tunisia. 45 people have died. Using a mathematical model based on the number of reported infected cases, the number of deaths, and the effect of the 18-day delay between infection and death, this study estimates the actual number of COVID-19 cases in Tunisia as 2555 cases. This paper analyses the evolution of the epidemic in Tunisia using population dynamics with an SEIR model combining susceptible cases S(t), asymptomatic infected cases A(t), reported infected cases V(t), and unreported infected cases U(t). This work measures the basic reproduction number [Formula], which is the average number of people infected by a COVID-19 infected person. The model predicts an [Formula]. Strict containment measures have led to a significant reduction in the reproduction rate. Contact tracing and respect for isolation have an impact: at the current time, we compute that Tunisia has an [Formula] (95% CI 0.14-0.70). These values depend on physical separation and can vary over time depending on the management of suspicious cases. Their objective estimation and the study of their evolution are however necessary to understand the pandemic and to reduce their unintended damage (due to an absence of symptoms, or the confusion of certain symptoms with less contagious diseases, or unavailable or unreliable tests).", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.04.20.20072272", "title": "A simulation of a COVID-19 epidemic based on a deterministic SEIR model", "authors": "Carcione, J. M.", "author_corresponding": "Jose' M Carcione", "author_corresponding_institution": "OGS - https://www.inogs.it/it/users/jos%C3%A9-maria-carcione", "date": "2020-04-24", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_no", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/24/2020.04.20.20072272.source.xml", "abstract": "An epidemic disease caused by a new coronavirus has spread in Northern Italy with a strong contagion rate. We implement an SEIR model to compute the infected population and number of casualties of this epidemic. The example may ideally regard the situation in the Italian Region of Lombardy, where the epidemic started on February 24, but by no means attempts to perform a rigorous case study in view of the lack of suitable data and uncertainty of the different parameters, namely, the variation of the degree of home isolation and social distancing as a function of time, the number of initially exposed individuals and infected people, the incubation and infectious periods and the fatality rate.\n\nFirst, we perform an analysis of the results of the model, by varying the parameters and initial conditions (in order the epidemic to start, there should be at least one exposed or one infectious human). Then, we consider the Lombardy case and calibrate the model with the number of dead individuals to date (April 28, 2020) and constraint the parameters on the basis of values reported in the literature. The peak occurs at day 37 (March 31) approximately, when there is a rapid decrease, with a reproduction ratio R0 = 3 initially, 1.36 at day 22 and 0.78 after day 35, indicating different degrees of lockdown. The predicted death toll is almost 15325 casualties, with 2.64 million infected individuals at the end of the epidemic. The incubation period providing a better fit of the dead individuals is 4.25 days and the infectious period is 4 days, with a fatality rate of 0.00144/day [values based on the reported (official) number of casualties]. The infection fatality rate (IFR) is 0.57 %, and 2.36 % if twice the reported number of casualties is assumed. However, these rates depend on the initially exposed individuals. If approximately nine times more individuals are exposed, there are three times more infected people at the end of the epidemic and IFR = 0.47 %. If we relax these constraints and use a wider range of lower and upper bounds for the incubation and infectious periods, we observe that a higher incubation period (13 versus 4.25 days) gives the same IFR (0.6 % versus 0.57 %), but nine times more exposed individuals in the first case. Other choices of the set of parameters also provide a good fit of the data, but some of the results may not be realistic. Therefore, an accurate determination of the fatality rate and characteristics of the epidemic is subject to the knowledge of precise bounds of the parameters.\n\nBesides the specific example, the analysis proposed in this work shows how isolation measures, social distancing and knowledge of the diffusion conditions help us to understand the dynamics of the epidemic. Hence, the importance to quantify the process to verify the effectiveness of the lockdown.", "published": "10.3389/fpubh.2020.00230", "server": "medrxiv"}, {"doi": "10.1101/2020.05.05.20092361", "title": "Cooperative virus propagation underlies COVID-19 transmission dynamics", "authors": "Dai, Z.; Locasale, J. W.", "author_corresponding": "Jason W Locasale", "author_corresponding_institution": "Duke University", "date": "2020-05-07", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/07/2020.05.05.20092361.source.xml", "abstract": "The global pandemic due to the emergence of a novel coronavirus (COVID-19) is a threat to the future health of humanity. There remains an urgent need to understand its transmission characteristics and design effective interventions to mitigate its spread. In this study, we define a non-linear (known in biochemistry models as allosteric or cooperative) relationship between viral shedding, viral dose and COVID-19 infection propagation. We develop a mathematical model of the dynamics of COVID-19 to link quantitative features of viral shedding, human exposure and transmission in nine countries impacted by the ongoing COVID-19 pandemic. The model was then used to evaluate the efficacy of interventions against virus transmission. We found that cooperativity was important to capture country-specific transmission dynamics and leads to resistance to mitigating transmission in mild or moderate interventions. The behaviors of the model emphasize that strict interventions greatly limiting both virus shedding and human exposure are indispensable to achieving effective containment of COVID-19.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.05.17.20104588", "title": "COVID 19: Real-time Forecasts of Confirmed Cases, Active Cases, and Health Infrastructure Requirements for India and its Majorly Affected States using the ARIMA model.", "authors": "Tyagi, R.; Bramhankar, M.; Pandey, M.; M, K.", "author_corresponding": "Rishabh Tyagi", "author_corresponding_institution": "International Institute for Population Sciences", "date": "2020-05-22", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "public and global health", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/22/2020.05.17.20104588.source.xml", "abstract": "Background: COVID-19 is an emerging infectious disease which has been declared a Pandemic by the World Health Organization (WHO) on 11th March 2020. The Indian public health care system is already overstretched, and this pandemic is making things even worse. That is why forecasting cases for India is necessary to meet the future demands of the health infrastructure caused due to COVID-19.\n\nObjective: Our study forecasts the confirmed and active cases for COVID-19 until July mid, using time series Autoregressive Integrated Moving Average (ARIMA) model. Additionally, we estimated the number of isolation beds, Intensive Care Unit (ICU) beds and ventilators required for the growing number of COVID-19 patients.\n\nMethods: We used ARIMA model for forecasting confirmed and active cases till the 15th July. We used time-series data of COVID-19 cases in India from 14th March to 22nd May. We estimated the requirements for ICU beds as 10%, ventilators as 5% and isolation beds as 85% of the active cases forecasted using the ARIMA model.\n\nResults: Our forecasts indicate that India will have an estimated 7,47,772 confirmed cases (95% CI: 493943, 1001601) and 296,472 active cases (95% CI:196820, 396125) by 15th July. While Maharashtra will be the most affected state, having the highest number of active and confirmed cases, Punjab is expected to have an estimated 115 active cases by 15th July. India needs to prepare 2,52,001 isolation beds (95% CI: 167297, 336706), 29,647 ICU beds (95% CI: 19682, 39612), and 14,824 ventilator beds (95% CI: 9841, 19806).\n\nConclusion: Our forecasts show an alarming situation for India, and Maharashtra in particular. The actual numbers can go higher than our estimated numbers as India has a limited testing facility and coverage.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.04.24.20077792", "title": "COVID-19 in India: State-wise Analysis and Prediction", "authors": "Ghosh, P.; Ghosh, R.; Chakraborty, B.", "author_corresponding": "Palash Ghosh", "author_corresponding_institution": "Indian Institute of Technology Guwahati", "date": "2020-04-29", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nd", "category": "public and global health", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/29/2020.04.24.20077792.source.xml", "abstract": "Coronavirus disease 2019 (COVID-19), a highly infectious disease, was first detected in Wuhan, China, in December 2019. The disease has spread to 212 countries and territories around the world and infected (confirmed) more than three million people. In India, the disease was first detected on 30 January 2020 in Kerala in a student who returned from Wuhan. The total (cumulative) number of confirmed infected people is more than 37000 till now across India (3 May 2020). Most of the research and newspaper articles focus on the number of infected people in the entire country. However, given the size and diversity of India, it may be a good idea to look at the spread of the disease in each state separately, along with the entire country. For example, currently, Maharashtra has more than 10000 confirmed cumulative infected cases, whereas West Bengal has less than 800 confirmed infected cases (1 May 2020). The approaches to address the pandemic in the two states must be different due to limited resources. In this article, we will focus the infected people in each state (restricting to only those states with enough data for prediction) and build three growth models to predict infected people for that state in the next 30 days. The impact of preventive measures on daily infected-rate is discussed for each state.\n\nHighlights of the Analysis: Data considered for analysis: up to 1 May 2020.\nC_LIO_LIOne model can mislead us. Here, we consider the exponential, the logistic and the SIS models along with daily infection-rate (DIR). We interpret the results jointly from all models rather than individually.\nC_LIO_LIWe expect DIR to be zero or negative to conclude that COVID-19 is not spreading in a state. Even a small positive DIR (say 0.01) indicates virus is spreading in the community. The virus can potentially increase the DIR anytime.\nC_LIO_LISevere: The states without a decreasing trend in DIR and near exponential growth in active infected cases are Maharashtra, Delhi, Gujarat, Madhya Pradesh, Andhra Pradesh, Uttar Pradesh, and West Bengal.\nC_LIO_LIModerate: The states with an almost decreasing trend in DIR and non-increasing growth in active infected cases are Tamil Nadu, Rajasthan, Punjab and Bihar.\nC_LIO_LIControlled: The states with a decreasing trend in DIR and decreasing growth in active infected cases in the last few days are Kerala, Haryana, Jammu and Kashmir, Karnataka, and Telangana.\nC_LIO_LIStates with non-decreasing DIR need to do much more in terms of the preventive measures immediately to combat the COVID-19 pandemic. On the other hand, the states with decreasing DIR can maintain the same status to see the DIR become zero or negative for consecutive 14 days to be able to declare the end of the pandemic.\nC_LI", "published": "10.2196/20341", "server": "medrxiv"}, {"doi": "10.1101/2020.05.15.20103069", "title": "Early transmission dynamics of COVID-19 in Chile: From sub-exponential ascending growth dynamics to a stationary disease wave, March-April, 2020", "authors": "Tariq, A.; Undurraga, E. A.; Laborde, C. C.; Vogt-Geisse, K.; Luo, R.; Rothenberg, R.; Chowell, G.", "author_corresponding": "Amna Tariq", "author_corresponding_institution": "Georgia State University  School of Public Health", "date": "2020-05-18", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/18/2020.05.15.20103069.source.xml", "abstract": "Since the detection of first case of COVID-19 in Chile on March 3rd, 2020, a total of 301019 cases including 6434 deaths have been reported in Chile as of July 7th, 2020. In this manuscript we estimate the reproduction number during the early transmission phase in Chile and study the effectiveness of control interventions by conducting short-term forecasts based on the early transmission dynamics of COVID-19. We also estimate the reproduction number and conduct short term forecasts for the most recent developments in the epidemic trajectory of COVID-19 in Chile (May 9th-July 7th, 2020) to study the effectiveness of re-imposition of lockdowns in the country. The incidence curve in Chile displays early sub-exponential growth dynamics with the scaling of growth parameter, p, estimated at 0.8 (95% CI: 0.7, 0.8) and the reproduction number, estimated at 1.8 (95% CI: 1.6, 1.9). Our analysis emphasizes that the control measures at the start of the epidemic significantly slowed down the spread of the virus. However, easing of the COVID-19 restrictions and spread of virus to the low income neighborhoods in May led to a new wave of infections, followed by the re-imposition of lockdowns in Santiago and other municipalities. These measures have decelerated the virus spread with R estimated at ~0.87(95% CI: 0.84, 0.89) as of July 7th, 2020. Our current findings point that the sustained transmission of SARS-CoV-2 in Chile is being brought under control. The COVID-19 epidemic followed an early sub-exponential growth trend (p ~0.8) that transformed into a linear growth trend (p ~0.5) as of July 7th, 2020. While the broad scale social distancing interventions have slowed the virus spread, the number of new COVID-19 cases continue to accrue, underscoring the need for persistent social distancing and active case detection and isolation efforts to bring epidemic under control.\n\nAuthor summary: In context of the ongoing COVID-19 pandemic, Chile is one of the hardest hit countries in Latin America, struggling to contain the spread of the virus. In this manuscript we employ renewal equation to estimate the reproduction number for the early ascending phase of the COVID-19 epidemic and the most recent time period to guide the magnitude and intensity of the interventions required to combat the COVID-19 epidemic. We also generate short terms forecasts based on the epidemic trajectory using phenomenological models and assess counterfactual scenarios to understand any additional resources required to contain the spread of virus. Our results indicate early sustained transmission of SARS-CoV-2. However, the initial control measures at the start of the epidemic significantly slowed down the spread of the virus whose effect is visible two weeks after the implementation of interventions. Easing of the COVID-19 restrictions in May led to a new wave of infections, followed by the re-imposition of lockdowns in Santiago and other municipalities. While the broad scale social distancing interventions have slowed the most recent spread of the virus spread, the number of new COVID-19 cases continue to accrue, underscoring the need for persistent social distancing efforts to bring epidemic under control.", "published": "10.1371/journal.pntd.0009070", "server": "medrxiv"}, {"doi": "10.1101/2020.04.05.20054288", "title": "Estimating the effect of physical distancing on the COVID-19 pandemic using an urban mobility index", "authors": "Soucy, J.-P. R.; Sturrock, S. L.; Berry, I.; Daneman, N.; MacFadden, D. R.; Brown, K. A.", "author_corresponding": "Jean-Paul R. Soucy", "author_corresponding_institution": "Division of Epidemiology, Dalla Lana School of Public Health, University of Toronto, Toronto, Canada", "date": "2020-04-07", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/07/2020.04.05.20054288.source.xml", "abstract": "Background: Governments have implemented population-wide physical distancing measures to control COVID-19, but metrics evaluating their effectiveness are not readily available.\n\nMethods: We used a publicly available mobility index from a popular transit application to evaluate the effect of physical distancing on infection growth rates and reproductive numbers in 40 jurisdictions between March 23 and April 12, 2020.\n\nFindings: A 10% decrease in mobility was associated with a 14.6% decrease (exp({beta}) = 0{middle dot}854; 95% credible interval: 0{middle dot}835, 0{middle dot}873) in the average daily growth rate and a -0{middle dot}061 (95% CI: -0{middle dot}071, -0{middle dot}052) change in the instantaneous reproductive number two weeks later.\n\nInterpretation: Our analysis demonstrates that decreases in urban mobility were predictive of declines in epidemic growth. Mobility metrics offer an appealing method to calibrate population-level physical distancing policy and implementation, especially as jurisdictions relax restrictions and consider alternative physical distancing strategies.\n\nFunding: No external funding was received for this study.\n\nResearch in Context Evidence before this study: Widespread physical distancing interventions implemented in response to the COVID-19 pandemic led to sharp declines in global mobility throughout March 2020. Real-time metrics to evaluate the effects of these measures on future case growth rates will be useful for calibrating further interventions, especially as jurisdictions begin to relax restrictions. We searched PubMed on May 22, 2020 for studies reporting the use of aggregated mobility data to measure the effects of physical distancing on COVID-19 cases, using the keywords \"COVID-19\", \"2019-nCoV\", or \"SARS-CoV-2\" in combination with \"mobility\", \"movement\", \"phone\", \"Google\", or \"Apple\". We scanned 252 published studies and found one that used mobility data to estimate the effects of physical distancing. This study evaluated temporal trends in reported cases in four U.S. metropolitan areas using a metric measuring the percentage of cell phone users leaving their homes. Many published papers examined how national and international travel predicted the spatial distribution of cases (particularly outflow from Wuhan, China), but very little has been published on metrics that could be used as prospective, proximal indicators of future case growth. We also identified a series of reports released by the Imperial College COVID-19 Response Team and several manuscripts deposited on preprint servers such as medRxiv addressing this topic, demonstrating this is an active area of research.\n\nAdded value of this study: We demonstrate that changes in a publicly available urban mobility index reported in over 40 global cities were associated with COVID-19 case growth rates and estimated reproductive numbers two to three weeks later. These cities, spread over 5 continents, include many regional epicenters of COVID-19 outbreaks. This is one of only a few studies using a mobility metric applicable to future growth rates that is both publicly available and international in scope.\n\nImplications of all the available evidence: Restrictions on human mobility have proved effective for controlling COVID-19 in China and the rest of the world. However, such drastic public health measures cannot be sustained indefinitely and are currently being relaxed in many jurisdictions. Publicly available mobility metrics offer a method of estimating the effects of changes in mobility before they are reflected in the trajectory of COVID-19 case growth rates and thus merit further evaluation.", "published": "10.7717/peerj.17455", "server": "medrxiv"}, {"doi": "10.1101/2020.04.13.20064519", "title": "Estimating the number of SARS-CoV-2 infections in the United States", "authors": "Thorpe, D. G.; Lyberger, K.", "author_corresponding": "Dayton G Thorpe", "author_corresponding_institution": "Independent Researcher", "date": "2020-04-17", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/17/2020.04.13.20064519.source.xml", "abstract": "We apply a model developed by The COVID-19 Response Team [S. Flaxman, S. Mishra, A. Gandy, et al., \"Estimating the number of infections and the impact of non-pharmaceutical interventions on COVID-19 in 11 European countries,\" tech. rep., Imperial College London, 2020.] to estimate the total number of SARS-CoV-2 infections in the United States. Across the United States we estimate as of April 18, 2020 the fraction of the population infected was 4.6% [3.6%, 5.8%], 21 times the portion of the population with a positive test result. Excluding New York state, which we estimate accounts for over half of infections in the United States, we estimate an infection rate of 2.3% [2.1%, 2.8%].\n\nWe include the timing of each states implementation of interventions including encouraging social distancing, closing schools, banning public events, and a lockdown / stay-at-home order. We assume fatalities are reported correctly and infer the number and timing of infections based on the infection fatality rate measured in populations that were tested universally for SARS-CoV-2. Underreporting of deaths would drive our estimates to be too low. Reporting of deaths on the wrong day could drive errors in either direction. This model does not include effects of herd immunity; in states where the estimated infection rate is very high - namely, New York - our estimates may be too high.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.03.15.20036582", "title": "Estimating unobserved SARS-CoV-2 infections in the United States", "authors": "Perkins, A.; Cavany, S. M.; Moore, S. M.; Oidtman, R. J.; Lerch, A.; Poterek, M.", "author_corresponding": "Alex Perkins", "author_corresponding_institution": "University of Notre Dame", "date": "2020-03-18", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/18/2020.03.15.20036582.source.xml", "abstract": "By March 2020, COVID-19 led to thousands of deaths and disrupted economic activity worldwide. As a result of narrow case definitions and limited capacity for testing, the number of unobserved SARS-CoV-2 infections during its initial invasion of the US remains unknown. We developed an approach for estimating the number of unobserved infections based on data that are commonly available shortly after the emergence of a new infectious disease. The logic of our approach is, in essence, that there are bounds on the amount of exponential growth of new infections that can occur during the first few weeks after imported cases start appearing. Applying that logic to data on imported cases and local deaths in the US through March 12, we estimated that 22,876 (95% posterior predictive interval: 7,451 - 53,044) infections occurred in the US by this date. By comparing the models predictions of symptomatic infections to local cases reported over time, we obtained daily estimates of the proportion of symptomatic infections detected by surveillance. This revealed that detection of symptomatic infections decreased throughout February as exponential growth of infections outpaced increases in testing. Between February 21 and March 12, we estimated an increase in detection of symptomatic infections, which was strongly correlated (median: 0.97, 95% PPI: 0.85 - 0.98) with increases in testing. These results suggest that testing was a major limiting factor in assessing the extent of SARS-CoV-2 transmission during its initial invasion of the US.\n\nSignificance Statement: Countries across the world observed dramatic rises in COVID-19 cases and deaths in March 2020. In the United States, delays in the availability of diagnostic testing prompted questions about the extent of unobserved community transmission. Using a simulation model informed by reported cases and deaths, we estimated that tens of thousands of people were infected by the time a national emergency was declared on March 13. Our results indicate that fewer than 20% of locally acquired, symptomatic infections in the US were detected over a period of a month. The existence of a large, unobserved reservoir of infection argues for the necessity of large-scale social distancing that went into effect to mitigate the impacts of SARS-CoV-2 on the US.", "published": "10.1073/pnas.2005476117", "server": "medrxiv"}, {"doi": "10.1101/2020.03.06.20032177", "title": "Evaluating the secondary transmission pattern and epidemic prediction of the COVID-19 in metropolitan areas of China", "authors": "Hong, N.; He, J.; Ma, Y.; Jiang, H.; Han, L.; Su, L.; Zhu, W.; Long, Y.", "author_corresponding": "Yun Long", "author_corresponding_institution": "Peking Union Medical College Hospital", "date": "2020-03-08", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/08/2020.03.06.20032177.source.xml", "abstract": "Understanding the transmission dynamics of COVID-19 is crucial for evaluating its spread pattern, especially in metropolitan areas of China, as its spread can lead to secondary outbreaks outside Wuhan, the center of the new coronavirus disease outbreak. In addition, the experiences gained and lessons learned from China have the potential to provide evidence to support other metropolitan areas and large cities outside China with emerging cases. We used data reported from January 24, 2020, to February 23, 2020, to fit a model of infection, estimate the likely number of infections in four high-risk metropolitan areas based on the number of cases reported, and increase the understanding of the COVID-19 spread pattern. Considering the effect of the official quarantine regulations and travel restrictions for China, which began January 23[~]24, 2020, we used the daily travel intensity index from the Baidu Maps app to roughly simulate the level of restrictions and estimate the proportion of the quarantined population. A group of SEIR model statistical parameters were estimated using Markov chain Monte Carlo (MCMC) methods and fitting on the basis of reported data. As a result, we estimated that the basic reproductive number, R0, was 2.91 in Beijing, 2.78 in Shanghai, 2.02 in Guangzhou, and 1.75 in Shenzhen based on the data from January 24, 2020, to February 23, 2020. In addition, we inferred the prediction results and compared the results of different levels of parameters. For example, in Beijing, the predicted peak number of cases was approximately 466 with a peak time of February 29, 2020; however, if the city were to implement different levels (strict, mild, or weak) of travel restrictions or regulation measures, the estimation results showed that the transmission dynamics would change and that the peak number of cases would differ by between 56% and [~]159%. We concluded that public health interventions would reduce the risk of the spread of COVID-19 and that more rigorous control and prevention measures would effectively contain its further spread but that the risk will increase when businesses and social activities return to normal before the end of the epidemic. Besides, the experiences gained and lessons learned from China are potential to provide evidences supporting for other metropolitan areas and big cities with emerging cases outside China.", "published": "10.3389/fmed.2020.00171", "server": "medrxiv"}, {"doi": "10.1101/2020.04.24.20078113", "title": "Extensions of the SEIR Model for the Analysis of Tailored Social Distancing and Tracing Approaches to Cope with COVID-19", "authors": "Grimm, V.; Mengel, F.; Schmidt, M.", "author_corresponding": "Martin Schmidt", "author_corresponding_institution": "Trier University", "date": "2020-04-29", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/29/2020.04.24.20078113.source.xml", "abstract": "In the context of the COVID-19 pandemic, governments worldwide face the challenge of designing tailored measures of epidemic control to provide reliable health protection while allowing societal and economic activity. In this paper, we propose an extension of the epidemiological SEIR model to enable a detailed analysis of commonly discussed tailored measures of epidemic control--among them group-specific protection and the use of tracing apps. We introduce groups into the SEIR model that may differ both in their underlying parameters as well as in their behavioral response to public health interventions. Moreover, we allow for different infectiousness parameters within and across groups, different asymptomatic, hospitalization, and lethality rates, as well as different take-up rates of tracing apps. We then examine predictions from these models for a variety of scenarios. Our results visualize the sharp trade-offs between different goals of epidemic control, namely a low death toll, avoiding overload of the health system, and a short duration of the epidemic. We show that a combination of tailored mechanisms, e.g., the protection of vulnerable groups together with a \"trace & isolate\" approach, can be effective in preventing a high death toll. Protection of vulnerable groups without further measures requires unrealistically strict isolation. A key insight is that high compliance is critical for the effectiveness of a \"trace & isolate\" approach. Our model allows to analyze the interplay of group-specific social distancing and tracing also beyond our case study in scenarios with a large number of groups reflecting, e.g., sectoral, regional, or age differentiation and group-specific behavioral responses.", "published": "10.1038/s41598-021-83540-2", "server": "medrxiv"}, {"doi": "10.1101/2020.03.28.20046177", "title": "A data-driven tool for tracking and predicting the course of COVID-19 epidemic as it evolves", "authors": "Huang, N. E.; Qiao, F.; Tung, K.-K.", "author_corresponding": "Ka-Kit Tung", "author_corresponding_institution": "University of Washington", "date": "2020-03-30", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/30/2020.03.28.20046177.source.xml", "abstract": "New COVID-19 epicenters have sprung up in Europe and US as the epidemic in China wanes. Many mechanistic models past predictions for China were widely off the mark (1, 2), and still vary widely for the new epicenters, due to uncertain disease characteristics. The epidemic ended in Wuhan, and later in South Korea, with less than 1% of their population infected, much less than that required to achieve \"herd immunity\". Now as most countries pursue the goal of \"suppressed equilibrium\", the traditional concept of \"herd immunity\" in epidemiology needs to be re-examined. Traditional model predictions of large potential impacts serve their purpose in prompting policy decisions on contact suppression and lockdown to combat the spread, and are useful for evaluating various scenarios. After imposition of these measures it is important to turn to statistical models that incorporate real-time information that reflects ongoing policy implementation and degrees of compliance to more realistically track and project the epidemics course. Here we apply such a tool, supported by theory and validated by past data as accurate, to US and Europe. Most countries started with a Reproduction Number of 4 and declined to around 1 at a rate highly dependent on contact-reduction measures.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.07.27.20163121", "title": "Impact Assessment of Full and Partial Stay-at-Home Orders, Face Mask Usage, and Contact Tracing: An Agent-Based Simulation Study of COVID-19 for an Urban Region", "authors": "Tatapudi, H.; Das, R.; Das, T. K.", "author_corresponding": "Hanisha Tatapudi", "author_corresponding_institution": "Industrial and Management Systems Engineering, University of South Florida", "date": "2020-07-29", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/07/29/2020.07.27.20163121.source.xml", "abstract": "PurposeVarious social intervention strategies to mitigate COVID-19 are examined using a comprehensive agent-based simulation model. A case study is conducted using a large urban region, Miami-Dade County, Florida, USA. Results are intended to serve as a planning guide for public health decision makers.\n\nMethods: The simulation model mimics daily social mixing behavior of the susceptible and infected generating the spread. Data representing demographics of the region, virus epidemiology, and social interventions shapes model behavior. Results include daily values of infected, reported, hospitalized, and dead.\n\nResults: Study results show that stay-at-home order is quite effective in flattening and then reversing the case growth curve subsiding the pandemic with only 5.8% of the population infected. Whereas, following Floridas current Phase II reopening plan could end the pandemic via herd immunity with 75% people infected. Use of surgical variety face masks reduced infected by 20%. A further reduction of 66% was achieved through contact tracing.\n\nConclusions: For Miami-Dade County, a strategy comprising mandatory use of face masks and aggressive contact tracing to identify 50% of the asymptomatic and pre-symptomatic, if adopted now, can potentially steer the COVID-19 pandemic to subside within next 3 months with approximately one fifth of the population infected.", "published": "10.1016/j.gloepi.2020.100036", "server": "medrxiv"}, {"doi": "10.1101/2020.04.01.20049767", "title": "Intervention Serology and Interaction Substitution: Modeling the Role of 'Shield Immunity' in Reducing COVID-19 Epidemic Spread", "authors": "Weitz, J. S.; Beckett, S. J.; Coenen, A. R.; Demory, D.; Dominguez-Mirazo, M.; Dushoff, J.; Leung, C.-Y.; Li, G.; Magalie, A.; Park, S. W.; Rodriguez-Gonzalez, R.; Shivam, S.; Zhao, C.", "author_corresponding": "Joshua S Weitz", "author_corresponding_institution": "Georgia Institute of Technology", "date": "2020-04-03", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/03/2020.04.01.20049767.source.xml", "abstract": "The COVID-19 pandemic has precipitated a global crisis, with more than 690,000 confirmed cases and more than 33,000 confirmed deaths globally as of March 30, 2020 [1-4]. At present two central public health control strategies have emerged: mitigation and suppression (e.g, [5]). Both strategies focus on reducing new infections by reducing interactions (and both raise questions of sustainability and long-term tactics). Complementary to those approaches, here we develop and analyze an epidemiological intervention model that leverages serological tests [6, 7] to identify and deploy recovered individuals as focal points for sustaining safer interactions via interaction substitution, i.e., to develop what we term  shield immunity at the population scale. Recovered individuals, in the present context, represent those who have developed protective, antibodies to SARS-CoV-2 and are no longer shedding virus [8]. The objective of a shield immunity strategy is to help sustain the interactions necessary for the functioning of essential goods and services (including but not limited to tending to the elderly [9], hospital care, schools, and food supply) while decreasing the probability of transmission during such essential interactions. We show that a shield immunity approach may significantly reduce the length and reduce the overall burden of an outbreak, and can work synergistically with social distancing. The present model highlights the value of serological testing as part of intervention strategies, in addition to its well recognized roles in estimating prevalence [10, 11] and in the potential development of plasma-based therapies [12-15].", "published": "10.1038/s41591-020-0895-3", "server": "medrxiv"}, {"doi": "10.1101/2020.03.14.20035659", "title": "Maximum entropy method for estimating the reproduction number: An investigation for COVID-19 in China", "authors": "Tao, Y.", "author_corresponding": "Yong Tao", "author_corresponding_institution": "Southwest University", "date": "2020-03-20", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/20/2020.03.14.20035659.source.xml", "abstract": "The key parameter that characterizes the transmissibility of a disease is the reproduction number R. If it exceeds 1, the number of incident cases will inevitably grow over time, and a large epidemic is possible. To prevent the expansion of an epidemic, R must be reduced to a level below 1. To estimate the reproduction number, the probability distribution function of the generation interval of an infectious disease is required to be available; however, this distribution is often unknown. In this letter, given the incomplete information for the generation interval, we propose a maximum entropy method to estimate the reproduction number. Based on this method, given the mean value and variance of the generation interval, we first determine its probability distribution function and in turn estimate the real-time values of reproduction number of COVID-19 in China. By applying these estimated reproduction numbers into the susceptible-infectious-removed epidemic model, we simulate the evolutionary track of the epidemic in China, which is well in accordance with that of the real incident cases. The simulation results predict that Chinas epidemic will gradually tend to disappear by May 2020 if the quarantine measures can continue to be executed.", "published": "10.1103/physreve.102.032136", "server": "medrxiv"}, {"doi": "10.1101/2020.07.26.20157040", "title": "Minimizing Population Health Loss in Times of Scarce Surgical Capacity", "authors": "Gravesteijn, B.; Krijkamp, E.; Busschbach, J.; Geleijnse, G.; Retel Helmrich, I.; Bruinsma, S.; van Lint, C.; van Veen, E.; Steyerberg, E.; Verhoef, C.; van Saase, J.; Lingsma, H.; Baatenburg de Jong, R.; Value Based Operation Room Triage team collaborators,  ", "author_corresponding": "Benjamin Gravesteijn", "author_corresponding_institution": "Erasmus Medical Center Rotterdam", "date": "2020-07-30", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "surgery", "jatsxml": "https://www.medrxiv.org/content/early/2020/07/30/2020.07.26.20157040.source.xml", "abstract": "Background: COVID-19 has put unprecedented pressure on healthcare systems worldwide, leading to a reduction of the available healthcare capacity. Our objective was to develop a decision model that supports prioritization of care from a utilitarian perspective, which is to minimize population health loss.\n\nMethods: A cohort state-transition model was developed and applied to 43 semi-elective non-paediatric surgeries commonly performed in academic hospitals. Scenarios of delaying surgery from two weeks were compared with delaying up to one year, and no surgery at all. Model parameters were based on registries, scientific literature, and the World Health Organization global burden of disease study. For each surgery, the urgency was estimated as the average expected loss of Quality-Adjusted Life-Years (QALYs) per month.\n\nResults: Given the best available evidence, the two most urgent surgeries were bypass surgery for Fontaine III/IV peripheral arterial disease (0.23 QALY loss/month, 95%-CI: 0.09-0.24) and transaortic valve implantation (0.15 QALY loss/month, 95%-CI: 0.09-0.24). The two least urgent surgeries were placing a shunt for dialysis (0.01, 95%-CI: 0.005-0.01) and thyroid carcinoma resection (0.01, 95%-CI: 0.01-0.02): these surgeries were associated with a limited amount of health lost on the waiting list.\n\nConclusion: Expected health loss due to surgical delay can be objectively calculated with our decision model based on best available evidence, which can guide prioritization of surgeries to minimize population health loss in times of scarcity. This tool should yet be placed in the context of different ethical perspectives and combined with capacity management tools to facilitate large-scale implementation.\n\nSummary: What is already known on this topic: The perspective of maximizing population health, a utilitarian ethical perspective, has been described to be most defendable in times of scarcity. To prioritize surgical patients, literature mainly discusses approaches which are intra-disciplinary (e.g. within gynecological or oncological surgery) and mostly existed of narrative reviews of the literature. Some decision tools were developed, which rely on the consensus of experts on various measures of urgency (e.g. health benefit, or time until inoperable). No approach was found which transparently weighs objective factors in order to quantify a clinically relevant measure of urgency.\n\nWhat this study adds: In contrast to previously developed approaches, our approach transparently and consistently aggregates best available objective evidence across disciplines. This novel aggregated urgency measure can be easily linked with capacity management tools. Our approach can help to minimize health losses when trying to overcome delay in surgeries in times of surgical scarcity, during the COVID-19 pandemic and beyond.", "published": "10.1016/j.jval.2022.01.027", "server": "medrxiv"}, {"doi": "10.1101/2020.04.11.20061952", "title": "Modeling COVID-19: Forecasting and analyzing the dynamics of the outbreak in Hubei and Turkey", "authors": "Aslan, i. H.; Demir, M.; Wise, M. M.; Lenhart, S.", "author_corresponding": "ibrahim Halil Aslan", "author_corresponding_institution": "Batman University", "date": "2020-04-15", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/15/2020.04.11.20061952.source.xml", "abstract": "As the pandemic of Coronavirus Disease 2019 (COVID-19) rages throughout the world, accurate modeling of the dynamics thereof is essential. However, since the availability and quality of data varies dramatically from region to region, accurate modeling directly from a global perspective is difficult, if not altogether impossible. Nevertheless, via local data collected by certain regions, it is possible to develop accurate local prediction tools, which may be coupled to develop global models.\n\nIn this study, we analyze the dynamics of local outbreaks of COVID-19 via a coupled system of ordinary differential equations (ODEs). Utilizing the large amount of data available from the ebbing outbreak in Hubei, China as a testbed, we estimate the basic reproductive number,[R] 0 of COVID-19 and predict the total cases, total deaths, and other features of the Hubei outbreak with a high level of accuracy. Through numerical experiments, we observe the effects of quarantine, social distancing, and COVID-19 testing on the dynamics of the outbreak. Using knowledge gleaned from the Hubei outbreak, we apply our model to analyze the dynamics of outbreak in Turkey. We provide forecasts for the peak of the outbreak and the total number of cases/deaths in Turkey, for varying levels of social distancing, quarantine, and COVID-19 testing.", "published": "10.1002/mma.8181", "server": "medrxiv"}, {"doi": "10.1101/2020.03.26.20044271", "title": "Negligible Risk of the COVID-19 Resurgence Caused by Work Resuming in China (outside Hubei): a Statistical Probability Study", "authors": "FU, X.", "author_corresponding": "XINMIAO FU", "author_corresponding_institution": "Fujian Normal University", "date": "2020-03-30", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/30/2020.03.26.20044271.source.xml", "abstract": "The COVID-19 outbreak in China appears to reach the late stage since late February 2020, and a stepwise restoration of economic operations is implemented. Risk assessment for such economic restoration is of significance. Here we estimated the probability of COVID-19 resurgence caused by work resuming in typical provinces/cities, and found that such probability is very limited (<5% for all the regions except Beijing). Our work may inform provincial governments to make risk level-based, differentiated control measures.", "published": "10.1093/pubmed/fdaa046", "server": "medrxiv"}, {"doi": "10.1101/2020.04.24.20078154", "title": "Predicting COVID-19 peaks around the world", "authors": "TSALLIS, C.; TIRNAKLI, U.", "author_corresponding": "Ugur TIRNAKLI", "author_corresponding_institution": "Ege University", "date": "2020-04-29", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/29/2020.04.24.20078154.source.xml", "abstract": "The official data for the time evolution of active cases of COVID-19 pandemics around the world are available online. For all countries, a peak has been either observed (China and South Korea) or is expected in near future. The approximate dates and heights of those peaks imply in important epidemiological issues. Inspired by similar complex behaviour of volumes of transactions of stocks at NYSE and NASDAQ, we propose a q-statistical functional form which appears to describe satisfactorily the available data of all countries. Consistently, predictions become possible of the dates and heights of those peaks in severely affected countries unless efficient treatments or vaccines, or sensible modifications of the adopted epidemiological strategies, emerge.", "published": "10.3389/fphy.2020.00217", "server": "medrxiv"}, {"doi": "10.1101/2020.03.11.20034314", "title": "Predicting the cumulative number of cases for the COVID-19 epidemic in China from early data", "authors": "Liu, Z.; magal, p.; Seydi, O.; Webb, G.", "author_corresponding": "Glenn Webb", "author_corresponding_institution": "Vanderbilt University", "date": "2020-03-13", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/13/2020.03.11.20034314.source.xml", "abstract": "We model the COVID-19 coronavirus epidemic in China. We use early reported case data to predict the cumulative number of reported cases to a final size. The key features of our model are the timing of implementation of major public policies restricting social movement, the identification and isolation of unreported cases, and the impact of asymptomatic infectious cases.", "published": "10.3934/mbe.2020172", "server": "medrxiv"}, {"doi": "10.1101/2020.05.15.20103028", "title": "Progression of COVID-19 in Indian States - Forecasting Endpoints Using SIR and Logistic Growth Models", "authors": "Malhotra, B.; Kashyap, V.", "author_corresponding": "Vishesh Kashyap", "author_corresponding_institution": "Delhi Technological University", "date": "2020-05-18", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_no", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/05/18/2020.05.15.20103028.source.xml", "abstract": "COVID-19 has led to the most widespread public health crisis in recent history. The first case of the disease was detected in India on 31 January 2019, and confirmed cases stand at 74,281 as of 13 May 2020. Mathematical modeling can be utilized to forecast the final numbers as well as the endpoint of the disease in India and its states, as well as assess the impact of social distancing measures. In the present work, the Susceptible-Infected-Recovered (SIR) model and the Logistic Growth model have been implemented to predict the endpoint of COVID-19 in India as well as three states accounting for over 55% of the total cases - Maharashtra, Gujarat and Delhi. The results using the SIR model indicate that the disease will reach an endpoint in India on 12 September, while Maharashtra, Gujarat and Delhi will reach endpoints on 20 August, 30 July and 9 September respectively. Using the Logistic Regression model, the endpoint for India is predicted on 23 July, while that for Maharashtra, Gujarat and Delhi is 5 July, 23 June and 10 August respectively. It is also observed that the case numbers predicted by the SIR model are greater than those for the Logistic Growth model in each case. The results suggest that the lockdown enacted by the Government of India has had only a moderate impact on the spread of COVID-19, and emphasize the need for firm implementation of social distancing guidelines.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.04.16.20068163", "title": "Projections for first-wave COVID-19 deaths across the US using social-distancing measures derived from mobile phones", "authors": "Woody, S.; Garcia Tec, M.; Dahan, M.; Gaither, K.; Fox, S.; Meyers, L. A.; Scott, J. G.", "author_corresponding": "James G Scott", "author_corresponding_institution": "University of Texas at Austin", "date": "2020-04-22", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_no", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/22/2020.04.16.20068163.source.xml", "abstract": "We propose a Bayesian model for projecting first-wave COVID-19 deaths in all 50 U.S. states. Our models projections are based on data derived from mobile-phone GPS traces, which allows us to estimate how social-distancing behavior is \"flattening the curve\" in each state. In a two-week look-ahead test of out-of-sample forecasting accuracy, our model significantly outperforms the widely used model from the Institute for Health Metrics and Evaluation (IHME), achieving 42% lower prediction error: 13.2 deaths per day average error across all U.S. states, versus 22.8 deaths per day average error for the IHME model. Our model also provides an accurate, if slightly conservative, assessment of forecasting accuracy: in the same look-ahead test, 98% of data points fell within the models 95% credible intervals. Our models projections are updated daily at https://covid-19.tacc.utexas.edu/projections/.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.04.17.20069443", "title": "A Path to the End of COIVD-19 - a Mathematical Model", "authors": "Shayak, B.; Rand, R. H.", "author_corresponding": "B Shayak", "author_corresponding_institution": "Cornell University", "date": "2020-04-22", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/22/2020.04.17.20069443.source.xml", "abstract": "In this work we use mathematical modeling to describe a possible route to the end of COVID-19, which does not feature either vaccination or herd immunity. We call this route self-burnout. We consider a region with (a) no influx of corona cases from the outside, (b) extensive social distancing, though not necessarily a full lockdown, and (c) high testing capacity relative to the actual number of new cases per day. These conditions can make it possible for the region to initiate the endgame phase of epidemic management, wherein the disease is slowly made to burn itself out through a combination of social distancing, sanitization, contact tracing and preventive testing. The dynamics of the case trajectories in this regime are governed by a single-variable first order linear delay differential equation, whose stability criterion can be obtained analytically. Basis this criterion, we conclude that the social mobility restrictions should be such as to ensure that on the average, one person interacts closely (from the transmission viewpoint) with at most one other person over a 4-5 day period. If the endgame can be played out for a long enough time, we claim that the Coronavirus can eventually get completely contained without affecting a significant fraction of the regions population. We present estimates of the duration for which the epidemic is expected to last, finding an interval of approximately 5-15 weeks after the self-burnout phase is initiated. South Korea, Austria, Australia, New Zealand and the states of Goa, Kerala and Odisha in India appear to be well on the way towards containing COVID by this method.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.04.03.20052373", "title": "Social distancing to slow the U.S. COVID-19 epidemic: an interrupted time-series analysis", "authors": "Siedner, M. J.; Harling, G.; Reynolds, Z.; Gilbert, R. F.; Venkataramani, A.; Tsai, A. C.", "author_corresponding": "Mark J Siedner", "author_corresponding_institution": "Massachusetts General Hospital", "date": "2020-04-08", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_no", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/08/2020.04.03.20052373.source.xml", "abstract": "Background: Social distancing measures to address the U.S. coronavirus disease 2019 (COVID-19) epidemic may have notable health and social impacts.\n\nMethods and Findings: We conducted a longitudinal pretest-posttest comparison group study to estimate the change in COVID-19 case growth before versus after implementation of statewide social distancing measures in the U.S. The primary exposure was time before (14 days prior to, and up to 3 days after) versus after (beginning 4 days after, and up to 21 days after) implementation of the first statewide social distancing measures. Statewide restrictions on internal movement were examined as a secondary exposure. The primary outcome was the COVID-19 case growth rate. The secondary outcome was the COVID-19-attributed mortality growth rate. All states initiated social distancing measures between March 10-25, 2020. The mean daily COVID-19 case growth rate decreased beginning four days after implementation of the first statewide social distancing measures, by 0.9% per day (95% confidence interval [CI], -1.3% to -0.4%; P<0.001). We did not estimate a statistically significant difference in the mean daily case growth rate before versus after implementation of statewide restrictions on internal movement (0.1% per day; 95% CI, -0.04% to 0.3%, P=0.14), but there is significant difficulty in disentangling the unique associations with statewide restrictions on internal movement from the unique associations with the first social distancing measures. Beginning seven days after social distancing, the COVID-19-attributed mortality growth rate decreased by 1.7% per day (95% CI, -3.0% to -0.7%; P<0.001). Our analysis is susceptible to potential bias resulting from the aggregate nature of the ecological data, potential confounding by contemporaneous changes (e.g., increases in testing), and potential underestimation of social distancing due to spillovers across neighboring states.\n\nConclusions: Statewide social distancing measures were associated with a decrease in the COVID-19 epidemic case growth rate that was statistically significant and a decrease in the COVID-19-attributed mortality growth rate that was not statistically significant.\n\nAuthor Summary: Why was the study done: There are few empirical data about the population health benefits of imposing statewide social distancing measures to reduce transmission of severe acute respiratory syndrome coronavirus 2, which causes coronavirus disease 2019 (COVID-19).\n\nWhat did the researchers find: We compared data from each state before vs. after implementation of statewide social distancing measures to estimate changes in mean COVID-19 daily case growth rates. Growth rates declined by approximately 1% per day beginning four days (approximately one incubation period) after statewide social distancing measures were implemented. Stated differently, our model implies that social distancing reduced the total number of COVID-19 cases by approximately 1,600 reported cases at 7 days after implementation, by approximately reported 55,000 cases at 14 days after implementation, and by approximately reported 600,000 cases at 21 days after implementation.\n\nWhat do these findings mean: Statewide social distancing measures were associated with a reduction in the growth rate of COVID-19 cases in the U.S. However, our analysis is susceptible to potential bias resulting from the aggregate nature of the data, potential confounding by other changes that occurred during the study period (e.g., increases in testing), and potential underestimation of social distancing due to spillovers across neighboring states.", "published": "10.1371/journal.pmed.1003244", "server": "medrxiv"}, {"doi": "10.1101/2020.04.19.20071605", "title": "Spatial analysis of COVID-19 spread in Iran: Insights into geographical and structural transmission determinants at a province level", "authors": "Ramirez-Aldana, R.; Gomez-Verjan, J. C.; Bello-Chavolla, O. Y.", "author_corresponding": "Ricardo Ramírez-Aldana", "author_corresponding_institution": "Research Division, Instituto Nacional de Geriatría (INGER), Anillo Perif. 2767, San Jeronimo Lidice, La Magdalena Contreras, 10200, Mexico City, Mexico.", "date": "2020-04-22", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/22/2020.04.19.20071605.source.xml", "abstract": "The Islamic Republic of Iran reported its first COVID-19 cases by 19th February 2020, since then it has become one of the most affected countries, with more than 73,000 cases and 4,585 deaths at the date. Spatial modeling could be used to approach an understanding of structural and sociodemographic factors that have impacted COVID-19 spread at a province-level in Iran. In the present paper, we developed a spatial statistical approach to describe how COVID-19 cases are spatially distributed and to identify significant spatial clusters of cases and how the socioeconomic features of Iranian provinces might predict the number of cases. We identified a cluster of provinces with significantly higher rates of COVID-19 cases around Tehran, which indicated that the spread of COVID-19 within Iran was spatially correlated. Urbanized, highly connected provinces with older population structures and higher average temperatures were the most susceptible to present a higher number of COVID-19 cases. Interestingly, literacy is a protective factor that might be directly related to health literacy and compliance with public health measures. These features indicate that policies related to social distancing, protecting older adults, and vulnerable populations, as well as promoting health literacy, might be targeted to reduce SARS-CoV2 spread in Iran. Our approach could be applied to model COVID-19 outbreaks in other countries with similar characteristics or in case of an upturn in COVID-19 within Iran.", "published": "10.1371/journal.pntd.0008875", "server": "medrxiv"}, {"doi": "10.1101/2020.04.01.20049668", "title": "Spatial variability in the risk of death from COVID-19 in Italy, 2020", "authors": "Mizumoto, K.; Dahal, S.; Chowell, G.", "author_corresponding": "Kenji Mizumoto", "author_corresponding_institution": "Kyoto University", "date": "2020-04-03", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/03/2020.04.01.20049668.source.xml", "abstract": "Objectives: Italy has been disproportionately affected by the COVID-19 pandemic, becoming the nation with the third highest death toll in the world as of May 10th, 2020. We analyzed the severity of COVID-19 pandemic across 20 Italian regions.\n\nMethod: We manually retrieved the daily cumulative numbers of laboratory-confirmed cases and deaths attributed to COVID-19 across 20 Italian regions. For each region, we estimated the crude case fatality ratio and time-delay adjusted case fatality ratio (aCFR). We then assessed the association between aCFR and sociodemographic, health care and transmission factors using multivariate regression analysis.\n\nResults: The overall aCFR in Italy was estimated at 17.4%. Lombardia exhibited the highest aCFR (24.7%) followed by Marche (19.3%), Emilia Romagna (17.7%) and Liguria (17.6%). Our aCFR estimate was greater than 10% for 12 regions. Our aCFR estimates were statistically associated with population density and cumulative morbidity rate in a multivariate analysis.\n\nConclusion: Our aCFR estimates for overall Italy and for 7 out of 20 regions exceeded those reported for the most affected region in China. Our findings highlight the importance of social distancing to suppress incidence and reduce the death risk by preventing saturating the health care system.", "published": "10.5588/ijtld.20.0262", "server": "medrxiv"}, {"doi": "10.1101/2020.04.05.20053884", "title": "Study of Epidemiological Characteristics and In-silico Analysis of the Effect of Interventions in the SARS-CoV-2 Epidemic in India", "authors": "Mazumder, A.; Arora, M.; Bharadiya, V.; Berry, P.; Agarwal, M.; Gupta, M.; Behera, P.", "author_corresponding": "Priyamadhaba Behera", "author_corresponding_institution": "All India Institute of Medical Sciences Raebareli", "date": "2020-04-07", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nc_nd", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/07/2020.04.05.20053884.source.xml", "abstract": "After SARS-CoV-2 set foot in India, the Government took a number of steps to limit the spread of the disease in the country. This study involves assessing how the disease affected the population in the initial days of the epidemic. Data was collected from government-controlled and crowdsourced websites and analyzed. Studying age and sex parameters of 413 Indian COVID-19 patients, the median age of the affected individuals was found to be 36 years (IQR, 25-54) with 20-39 years males being the most affected group. The number of affected males (66.34%) was more than that of the females (33.66%). Using Susceptible-Infected-Removed (SIR) model, the range of contact rate ({beta}) of India was calculated and the role of public health interventions was assessed. If current contact rate continues, India may have 5583 to 13785 active cases at the end of 21 days lockdown.\n\nArticle Summary Line: The study gives the epidemiological characteristics of the SARS-CoV-2 epidemic in India, where unlike other countries, the 20-39 years males are most affected, and the SIR model predicts the probable number of cases of COVID-19 by the end of the 21 days lockdown in the country, which will help to develop appropriate public health interventions to control the COVID-19 epidemic.", "published": "NA", "server": "medrxiv"}, {"doi": "10.1101/2020.03.28.20036715", "title": "The first three months of the COVID-19 epidemic: Epidemiological evidence for two separate strains of SARS-CoV-2 viruses spreading and implications for prevention strategies", "authors": "Wittkowski, K. M.", "author_corresponding": "Knut M. Wittkowski", "author_corresponding_institution": "ASDERA LLC", "date": "2020-03-31", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/31/2020.03.28.20036715.source.xml", "abstract": "About one month after the COVID-19 epidemic peaked in Mainland China and SARS-CoV-2 migrated to Europe and then the U.S., the epidemiological data begin to provide important insights into the risks associated with the disease and the effectiveness of intervention strategies such as travel restrictions and lockdowns (\"social distancing\"). Respiratory diseases, including the 2003 SARS epidemic, remain only about two months in any given population, although peak incidence and lethality can vary. The epidemiological data suggest that at least two strains of the 2020 SARS-CoV-2 virus have evolved during its migration from Mainland China to Europe. South Korea, Iran, Italy, and Italys neighbors were hit by the more dangerous \"SKII\" variant. While the epidemic in continental Asia is about to end, and in Europe about to level off, the more recent epidemic in the younger US population is still increasing, albeit not exponentially anymore. The peak level will likely depend on which of the strains has entered the U.S. first. The same models that help us to understand the epidemic also help us to choose prevention strategies. Containment of high-risk people, like the elderly, and reducing disease severity, either by vaccination or by early treatment of complications, is the best strategy against a respiratory virus disease. Lockdowns can be effective during the month following the peak incidence in infections, when the exponential increase of cases ends. Earlier containment of low-risk people merely prolongs the time the virus needs to circulate until the incidence is high enough to initiate \"herd immunity\". Later containment is not helpful, unless to prevent a rebound if containment started too early.\n\nAbout the Author: Dr. Wittkowski received his PhD in computer science from the University of Stuttgart and his ScD (Habilitation) in Medical Biometry from the Eberhard-Karls-University Tubingen, both Germany. He worked for 15 years with Klaus Dietz, a leading epidemiologist who coined the term \"reproduction number\", on the Epidemiology of HIV before heading for 20 years the Department of Biostatistics, Epidemiology, and Research Design at The Rockefeller University, New York. Dr. Wittkowski is currently the CEO of ASDERA LLC, a company discovering novel interventions against complex (incl. coronavirus) diseases from data of genome-wide association studies.", "published": "10.7759/cureus.29146", "server": "medrxiv"}, {"doi": "10.1101/2020.04.21.20074435", "title": "The spatio-temporal epidemic dynamics of COVID-19 outbreak in Africa", "authors": "Gayawan, E.; Awe, O.; Oseni, B. M.; Uzochukwu, I. C.; Adekunle, A. I.; Samuel, G.; Eisen, D.; Adegboye, O.", "author_corresponding": "Ezra Gayawan", "author_corresponding_institution": "Federal University of Technology, Akure, Nigeria", "date": "2020-04-25", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by", "category": "epidemiology", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/25/2020.04.21.20074435.source.xml", "abstract": "The novel coronavirus (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), emerged in the city of Wuhan, China in December 2019. Although, the disease appears on the African continent late, it has spread to virtually all the countries. We provide early spatio-temporal dynamics of COVID-19 within the first 62 days of the diseases appearance on the African continent. We used a two-parameter hurdle Poisson model to simultaneously analyze the zero counts and the frequency of occurrence. We investigate the effects of important healthcare capacities including hospital beds and number of medical doctors in the different countries. The results show that cases of the pandemic vary geographically across Africa with notable high incidence in neighboring countries particularly in West and North Africa. The burden of the disease (per 100,000) was most felt in Djibouti Tunisia, Morocco and Algeria. Temporally, during the first 4 weeks, the burden was highest in Senegal, Egypt and Mauritania, but by mid-April it shifted to Somalia, Chad, Guinea, Tanzania, Gabon, Sudan, and Zimbabwe. Currently, Namibia, Angola, South Sudan, Burundi and Uganda have the least burden. The findings could be useful in implementing epidemiological intervention and allocation of scarce resources based on heterogeneity of the disease patterns.", "published": "10.1017/S0950268820001983", "server": "medrxiv"}, {"doi": "10.1101/2020.03.09.20033514", "title": "The time scale of asymptomatic transmission affects estimates of epidemic potential in the COVID-19 outbreak", "authors": "Park, S. W.; Cornforth, D. M.; Dushoff, J.; Weitz, J. S.", "author_corresponding": "Joshua S Weitz", "author_corresponding_institution": "Georgia Institute of Technology", "date": "2020-03-13", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by_nd", "category": "infectious diseases", "jatsxml": "https://www.medrxiv.org/content/early/2020/03/13/2020.03.09.20033514.source.xml", "abstract": "The role of asymptomatic carriers in transmission poses challenges for control of the COVID-19 pandemic. Study of asymptomatic transmission and implications for surveillance and disease burden are ongoing, but there has been little study of the implications of asymp- tomatic transmission on dynamics of disease. We use a mathematical framework to evaluate expected effects of asymptomatic transmission on the basic reproduction number[R] 0 (i.e., the expected number of secondary cases generated by an average primary case in a fully sus- ceptible population) and the fraction of new secondary cases attributable to asymptomatic individuals. If the generation-interval distribution of asymptomatic transmission differs from that of symptomatic transmission, then estimates of the basic reproduction number which do not explicitly account for asymptomatic cases may be systematically biased. Specifically, if asymptomatic cases have a shorter generation interval than symptomatic cases,[R] 0 will be over-estimated, and if they have a longer generation interval,[R] 0 will be under-estimated. Estimates of the realized proportion of asymptomatic transmission during the exponential phase also depend on asymptomatic generation intervals. Our analysis shows that understanding the temporal course of asymptomatic transmission can be important for assessing the importance of this route of transmission, and for disease dynamics. This provides an additional motivation for investigating both the importance and relative duration of asymptomatic transmission.", "published": "10.1016/j.epidem.2020.100392", "server": "medrxiv"}, {"doi": "10.1101/2020.04.15.20066845", "title": "Why lockdown? Simplified arithmetic tools for decision-makers, health professionals, journalists and the general public to explore containment options for the novel coronavirus", "authors": "Killeen, G.; Kiware, S.", "author_corresponding": "Gerry Killeen", "author_corresponding_institution": "Ifakara Health Institute", "date": "2020-04-20", "version": "1", "type": "PUBLISHAHEADOFPRINT", "license": "cc_by", "category": "public and global health", "jatsxml": "https://www.medrxiv.org/content/early/2020/04/20/2020.04.15.20066845.source.xml", "abstract": "Half the worlds population is already under lock-down and the remainder will have to follow if the ongoing novel coronavirus 2019 (COVID-19) virus pandemic is to be contained. Faced with such brutally difficult decisions, it is essential that as many people as possible understand (1) why lock-down interventions represent the only realistic way for individual countries to contain their national-level epidemics before they turn into public health catastrophes, (2) why these need to be implemented so early, so aggressively and for such extended periods, and (3) why international co-operation to conditionally re-open trade and travel between countries that have successfully eliminated local transmission represents the only way to contain the pandemic at global level. Here we present simplified arithmetic models of COVID-19 transmission, control and elimination in user-friendly Shiny and Excel formats that allow non-specialists to explore, query, critique and understand the containment decisions facing their country and the world at large. Based on parameter values representative of the United Republic of Tanzania, which is still early enough in its epidemic cycle and response to avert a national catastrophe, national containment and elimination with less than 10 deaths is predicted for highly rigorous lock down within 5 weeks of the first confirmed cases and maintained for 15 weeks. However, elimination may only be sustained if case importation from outside the country is comprehensively contained by isolating for three weeks all incoming travellers, except those from countries certified as COVID-free in the future. Any substantive relaxation of these assumptions, specifically shortening the lock-down period, less rigorous lock-down or imperfect importation containment, may facilitate epidemic re-initiation, resulting in over half a million deaths unless rigorously contained a second time. Removing contact tracing and isolation has minimal impact on successful containment trajectories because high incidence of similar mild symptoms caused by other common pathogens attenuates detection success of COVID-19 testing. Nevertheless, contact tracing is recommended as an invaluable epidemiological surveillance platform for monitoring and characterizing the epidemic, and for understanding the influence of interventions on transmission dynamics.", "published": "10.1016/j.idm.2020.06.006", "server": "medrxiv"}, {"doi": "2006.01754v1", "title": "ARIMA forecasting of COVID-19 incidence in Italy, Russia, and the USA", "abstract": "The novel Coronavirus disease (COVID-19) is a severe respiratory infection\nthat officially occurred in Wuhan, China, in December 2019. In late February,\nthe disease began to spread quickly across the world, causing serious health,\nsocial, and economic emergencies. This paper aims to forecast the incidence of\nthe COVID-19 epidemic through the medium of an autoregressive integrated moving\naverage (ARIMA) model, applied to Italy, Russia, and the USA, in three\ndifferent time windows. The forecasts show that: i) the Arima models are\nreliable enough when new daily cases begin to stabilize; and ii) Russia and the\nUSA will require more time than Italy to drop COVID-19 cases near zero. This\nmay suggest the importance of the application of lockdown measures, which have\nbeen relatively stricter in Italy. Therefore, even if the results should be\ninterpreted with caution, ARIMA models seem to be a good tool that can help the\nhealth authorities to monitor the diffusion of the outbreak.", "date": "2020-05-28", "authors": "Gaetano Perone", "server": "arxiv"}, {"doi": "2007.06541v1", "title": "Bayesian Modeling of COVID-19 Positivity Rate -- the Indiana experience", "abstract": "In this short technical report we model, within the Bayesian framework, the\nrate of positive tests reported by the the State of Indiana, accounting also\nfor the substantial variability (and overdispeartion) in the daily count of the\ntests performed. The approach we take, results with a simple procedure for\nprediction, a posteriori, of this rate of 'positivity' and allows for an easy\nand a straightforward adaptation by any agency tracking daily results of\nCOVID-19 tests. The numerical results provided herein were obtained via an\nupdatable R Markdown document.", "date": "2020-07-09", "authors": "Ben Boukai; Jiayue Wang", "server": "arxiv"}, {"doi": "2004.12799v1", "title": "Dynamics of Interacting Hotspots -- I", "abstract": "The worldwide spread of COVID-19 has called for fast advancement of new\nmodelling strategies to estimate its unprecedented spread. Here, we introduce a\nmodel based on the fundamental SIR equations with a stochastic disorder by a\nrandom exchange of infected populations between cities to study dynamics in an\ninteracting network of epicentres in a model state. Although each stochastic\nexchange conserves populations pair-wise, the disorder drives the global system\ntowards newer routes to dynamic equilibrium. Upon controlling the range of the\nexchange fraction, we show that it is possible to control the heterogeneity in\nthe spread and the co-operativity among the interacting hotspots. Data of\ncollective temporal evolution of the infected populations in federal states of\nGermany validate the qualitative features of the model.", "date": "2020-04-24", "authors": "Suman Dutta", "server": "arxiv"}, {"doi": "2005.00106v1", "title": "Effects of weather and policy intervention on COVID-19 infection in Ghana", "abstract": "Even though laboratory and epidemiological studies have demonstrated the\neffects of ambient temperature on the transmission and survival of\ncoronaviruses, not much has been done on the effects of weather on the spread\nof COVID-19. This study investigates the effects of temperature, humidity,\nprecipitation, wind speed and the specific government policy intervention of\npartial lockdown on the new cases of COVID-19 infection in Ghana. Daily data on\nconfirmed cases of COVID-19 from March 13, 2020 to April 21, 2020 were obtained\nfrom the official website of Our World in Data (OWID) dedicated to COVID-19\nwhile satellite climate data for the same period was obtained from the official\nwebsite of NASA's Prediction of Worldwide Energy Resources (POWER) project.\nConsidering the nature of the data and the objectives of the study, a time\nseries generalized linear model which allows for regressing on past\nobservations of the response variable and covariates was used for model\nfitting. The results indicate significant effects of maximum temperature,\nrelative humidity and precipitation in predicting new cases of the disease.\nAlso, results of the intervention analysis indicate that the null hypothesis of\nno significant effect of the specific policy intervention of partial lockdown\nshould be rejected (p-value=0.0164) at a 5\\% level of significance. These\nfindings provide useful insights for policymakers and the public.", "date": "2020-04-28", "authors": "Wahab Abdul Iddrisu; Peter Appiahene; Justice A. Kessie", "server": "arxiv"}, {"doi": "2004.02605v2", "title": "Estimating the number of SARS-CoV-2 infections and the impact of social distancing in the United States", "abstract": "Understanding the number of individuals who have been infected with the novel\ncoronavirus SARS-CoV-2, and the extent to which social distancing policies have\nbeen effective at limiting its spread, are critical for effective policy going\nforward. Here we present estimates of the extent to which confirmed cases in\nthe United States undercount the true number of infections, and analyze how\neffective social distancing measures have been at mitigating or suppressing the\nvirus. Our analysis uses a Bayesian model of COVID-19 fatalities with a\nlikelihood based on an underlying differential equation model of the epidemic.\nWe provide analysis for four states with significant epidemics: California,\nFlorida, New York, and Washington. Our short-term forecasts suggest that these\nstates may be following somewhat different trajectories for growth of the\nnumber of cases and fatalities.", "date": "2020-04-06", "authors": "James Johndrow; Kristian Lum; Maria Gargiulo; Patrick Ball", "server": "arxiv"}, {"doi": "10.1063/5.0008834", "title": "Asymptotic estimates of SARS-CoV-2 infection counts and their sensitivity to stochastic perturbation", "abstract": "Despite the importance of having robust estimates of the time-asymptotic total number of infections, early estimates of COVID-19 show enormous fluctuations. Using COVID-19 data from different countries, we show that predictions are extremely sensitive to the reporting protocol and crucially depend on the last available data point before the maximum number of daily infections is reached. We propose a physical explanation for this sensitivity, using a susceptible–exposed–infected–recovered model, where the parameters are stochastically perturbed to simulate the difficulty in detecting patients, different confinement measures taken by different countries, as well as changes in the virus characteristics. Our results suggest that there are physical and statistical reasons to assign low confidence to statistical and dynamical fits, despite their apparently good statistical scores. These considerations are general and can be applied to other epidemics. COVID-19 is currently affecting over 180 countries worldwide and poses serious threats to public health as well as economic and social stability of many countries. Modeling and extrapolating in near real-time the evolution of COVID-19 epidemics is a scientific challenge, which requires a deep understanding of the non-linearities undermining the dynamics of the epidemics. Here, we show that real-time predictions of COVID-19 infections are extremely sensitive to errors in data collection and crucially depend on the last available data point. We test these ideas in both statistical (logistic) and dynamical (susceptible–exposed–infected–recovered) models that are currently used to forecast the evolution of the COVID-19 epidemic. Our goal is to show how uncertainties arising from both poor data quality and inadequate estimations of model parameters (incubation, infection, and recovery rates) propagate to long-term extrapolations of infection counts. We provide guidelines for reporting those uncertainties to the scientific community and the general public."}, {"doi": "10.1080/17513758.2020.1795285", "title": "Effects of age-targeted sequestration for COVID-19", "abstract": "We model the extent to which age-targeted protective sequestration can be used to reduce ICU admissions caused by novel coronavirus COVID-19. Using demographic data from New Zealand, we demonstrate that lowering the age threshold to 50 years of age reduces ICU admissions drastically and show that for sufficiently strict isolation protocols, sequestering one-third of the countries population for a total of 8 months is sufficient to avoid overwhelming ICU capacity throughout the entire course of the epidemic. Similar results are expected to hold for other countries, though some minor adaption will be required based on local age demographics and hospital facilities."}, {"doi": "10.1016/j.mjafi.2020.03.022", "title": "Healthcare impact of COVID-19 epidemic in India: A stochastic mathematical model", "abstract": "Background: In India, the SARS-CoV-2 COVID-19 epidemic has grown to 1251 cases and 32 deaths as on 30 Mar 2020. The healthcare impact of the epidemic in India was studied using a stochastic mathematical model. Methods: A compartmental SEIR model was developed, in which the flow of individuals through compartments is modeled using a set of differential equations. Different scenarios were modeled with 1000 runs of Monte Carlo simulation each using MATLAB. Hospitalization, intensive care unit (ICU) requirements, and deaths were modeled on SimVoi software. The impact of nonpharmacological interventions (NPIs) including social distancing and lockdown on checking the epidemic was estimated. Results: Uninterrupted epidemic in India would have resulted in more than 364 million cases and 1.56 million deaths with peak by mid-July. As per the model, at current growth rate of 1.15, India is likely to reach approximately 3 million cases by 25 May, implying 125,455 (±18,034) hospitalizations, 26,130 (±3298) ICU admissions, and 13,447 (±1819) deaths. This would overwhelm India's healthcare system. The model shows that with immediate institution of NPIs, the epidemic might still be checked by mid-April 2020. It would then result in 241,974 (±33,735) total infections, 10,214 (±1649) hospitalizations, 2121 (±334) ICU admissions, and 1081 (±169) deaths. Conclusion: At the current growth rate of epidemic, India's healthcare resources will be overwhelmed by the end of May. With the immediate institution of NPIs, total cases, hospitalizations, ICU requirements, and deaths can be reduced by almost 90%."}, {"doi": "10.3934/publichealth.2020026", "title": "Parameter estimation and prediction for coronavirus disease outbreak 2019 (COVID-19) in Algeria.", "abstract": "Background: The wave of the coronavirus disease outbreak in 2019 (COVID-19) has spread all over the world. In Algeria, the first case of COVID-19 was reported on 25 February, 2020, and the number of confirmed cases of it has increased day after day. To overcome this difficult period and a catastrophic scenario, a model-based prediction of the possible epidemic peak and size of COVID-19 in Algeria is required. Methods: We are concerned with a classical epidemic model of susceptible, exposed, infected and removed (SEIR) population dynamics. By using the method of least squares and the best fit curve that minimizes the sum of squared residuals, we estimate the epidemic parameter and the basic reproduction number R0. Moreover, we discuss the effect of intervention in a certain period by numerical simulation. Results: We find that R0= 4.1, which implies that the epidemic in Algeria could occur in a strong way. Moreover, we obtain the following epidemiological insights: the intervention has a positive effect on the time delay of the epidemic peak; the epidemic size is almost the same for a short intervention; a large epidemic can occur even if the intervention is long and sufficiently effective. Conclusion: Algeria must implement the strict measures as shown in this study, which could be similar to the one that China has finally adopted."}, {"doi": "10.1371/journal.pone.0234763", "title": "Prediction of COVID-19 spreading profiles in South Korea, Italy and Iran by data-driven coding", "abstract": "This work applies a data-driven coding method for prediction of the COVID-19 spreading profile in any given population that shows an initial phase of epidemic progression. Based on the historical data collected for COVID-19 spreading in 367 cities in China and the set of parameters of the augmented Susceptible-Exposed-Infected-Removed (SEIR) model obtained for each city, a set of profile codes representing a variety of transmission mechanisms and contact topologies is formed. By comparing the data of an early outbreak of a given population with the complete set of historical profiles, the best fit profiles are selected and the corresponding sets of profile codes are used for prediction of the future progression of the epidemic in that population. Application of the method to the data collected for South Korea, Italy and Iran shows that peaks of infection cases are expected to occur before mid April, the end of March and the end of May 2020, and that the percentage of population infected in each city or region will be less than 0.01%, 0.5% and 0.5%, for South Korea, Italy and Iran, respectively."}, {"doi": "10.1016/j.annepidem.2020.07.007", "title": "Risk for COVID-19 infection and death among Latinos in the United States: examining heterogeneity in transmission dynamics.", "abstract": "Purpose: The purpose of this study was to ascertain COVID-19 transmission dynamics among Latino communities nationally. Methods: We compared predictors of COVID-19 cases and deaths between disproportionally Latino counties (≥17.8% Latino population) and all other counties through May 11, 2020. Adjusted rate ratios (aRRs) were estimated using COVID-19 cases and deaths via zero-inflated binomial regression models. Results: COVID-19 diagnoses rates were greater in Latino counties nationally (90.9 vs. 82.0 per 100,000). In multivariable analysis, COVID-19 cases were greater in Northeastern and Midwestern Latino counties (aRR: 1.42, 95% CI: 1.11-1.84, and aRR: 1.70, 95% CI: 1.57-1.85, respectively). COVID-19 deaths were greater in Midwestern Latino counties (aRR: 1.17, 95% CI: 1.04-1.34). COVID-19 diagnoses were associated with counties with greater monolingual Spanish speakers, employment rates, heart disease deaths, less social distancing, and days since the first reported case. COVID-19 deaths were associated with household occupancy density, air pollution, employment, days since the first reported case, and age (fewer <35 yo). Conclusions: COVID-19 risks and deaths among Latino populations differ by region. Structural factors place Latino populations and particularly monolingual Spanish speakers at elevated risk for COVID-19 acquisition."}, {"doi": "10.12688/wellcomeopenres.15788.1", "title": "The contribution of pre-symptomatic infection to the transmission dynamics of COVID-2019", "abstract": "Background: Pre-symptomatic transmission can be a key determinant of the effectiveness of containment and mitigation strategies for infectious diseases, particularly if interventions rely on syndromic case finding. For COVID-19, infections in the absence of apparent symptoms have been reported frequently alongside circumstantial evidence for asymptomatic or pre-symptomatic transmission. We estimated the potential contribution of pre-symptomatic cases to COVID-19 transmission. Methods: Using the probability for symptom onset on a given day inferred from the incubation period, we attributed the serial interval reported from Shenzen, China, into likely pre-symptomatic and symptomatic transmission. We used the serial interval derived for cases isolated more than 6 days after symptom onset as the no active case finding scenario and the unrestricted serial interval as the active case finding scenario. We reported the estimate assuming no correlation between the incubation period and the serial interval alongside a range indicating alternative assumptions of positive and negative correlation. Results: We estimated that 23% (range accounting for correlation: 12 - 28%) of transmissions in Shenzen may have originated from presymptomatic infections. Through accelerated case isolation following symptom onset, this percentage increased to 46% (21 - 46%), implying that about 35% of secondary infections among symptomatic cases have been prevented. These results were robust to using reported incubation periods and serial intervals from other settings. Conclusions: Pre-symptomatic transmission may be essential to consider for containment and mitigation strategies for COVID-19."}]